nxp-appcodehub/an-kw4x-bluetooth-le-nfc-integration/kw45b41zevk_w_uart_ncf3320_basic_discovery/startup/startup_kw45b41z83.c
WEAK void I3C0_IRQHandler(void)
{   I3C0_DriverIRQHandler();
}

WEAK void LPSPI0_IRQHandler(void)
{   LPSPI0_DriverIRQHandler();
}

WEAK void LPSPI1_IRQHandler(void)
{   LPSPI1_DriverIRQHandler();
}

WEAK void LPUART0_IRQHandler(void)
{   LPUART0_DriverIRQHandler();
}

WEAK void LPUART1_IRQHandler(void)
{   LPUART1_DriverIRQHandler();
}

WEAK void FLEXIO0_IRQHandler(void)
{   FLEXIO0_DriverIRQHandler();
}

WEAK void CAN0_IRQHandler(void)
{   CAN0_DriverIRQHandler();
}

WEAK void RF_IMU0_IRQHandler(void)
{   RF_IMU0_DriverIRQHandler();
}

WEAK void RF_IMU1_IRQHandler(void)
{   RF_IMU1_DriverIRQHandler();
}

WEAK void RF_NBU_IRQHandler(void)
{   RF_NBU_DriverIRQHandler();
}

WEAK void RF_FMU_IRQHandler(void)
{   RF_FMU_DriverIRQHandler();
}

WEAK void RF_WOR_IRQHandler(void)
{   RF_WOR_DriverIRQHandler();
}

WEAK void Reserved69_IRQHandler(void)
{   Reserved69_DriverIRQHandler();
}

WEAK void RF_Generic_IRQHandler(void)
{   RF_Generic_DriverIRQHandler();
}

WEAK void RF_BRIC_IRQHandler(void)
{   RF_BRIC_DriverIRQHandler();
}

WEAK void RF_LANT_SW_IRQHandler(void)
{   RF_LANT_SW_DriverIRQHandler();
}

WEAK void RFMC_IRQHandler(void)
{   RFMC_DriverIRQHandler();
}

WEAK void DSB_IRQHandler(void)
{   DSB_DriverIRQHandler();
}

WEAK void GPIOA_INT0_IRQHandler(void)
{   GPIOA_INT0_DriverIRQHandler();
}

WEAK void GPIOA_INT1_IRQHandler(void)
{   GPIOA_INT1_DriverIRQHandler();
}

WEAK void GPIOB_INT0_IRQHandler(void)
{   GPIOB_INT0_DriverIRQHandler();
}

WEAK void GPIOB_INT1_IRQHandler(void)
{   GPIOB_INT1_DriverIRQHandler();
}

WEAK void GPIOC_INT0_IRQHandler(void)
{   GPIOC_INT0_DriverIRQHandler();
}

WEAK void GPIOC_INT1_IRQHandler(void)
{   GPIOC_INT1_DriverIRQHandler();
}

WEAK void GPIOD_INT0_IRQHandler(void)
{   GPIOD_INT0_DriverIRQHandler();
}

WEAK void GPIOD_INT1_IRQHandler(void)
{   GPIOD_INT1_DriverIRQHandler();
}

WEAK void PORTA_EFT_IRQHandler(void)
{   PORTA_EFT_DriverIRQHandler();
}

WEAK void PORTB_EFT_IRQHandler(void)
{   PORTB_EFT_DriverIRQHandler();
}

WEAK void PORTC_EFT_IRQHandler(void)
{   PORTC_EFT_DriverIRQHandler();
}

WEAK void PORTD_EFT_IRQHandler(void)
{   PORTD_EFT_DriverIRQHandler();
}

WEAK void ADC0_IRQHandler(void)
{   ADC0_DriverIRQHandler();
}

WEAK void LPCMP0_IRQHandler(void)
{   LPCMP0_DriverIRQHandler();
}

WEAK void LPCMP1_IRQHandler(void)
{   LPCMP1_DriverIRQHandler();
}

WEAK void VBAT_IRQHandler(void)
{   VBAT_DriverIRQHandler();
}

//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
